#!/bin/sh
############################################################
##
## 計算問題自動生成スクリプト
##
############################################################

if [ $# != 1 ] && [ $# != 2 ]; then 
    echo "usage:$0  sort num";
    exit;
fi

if [ $1 == "-h" ] || [ $1 == "-help" ]; then
    cat << EOS
計算問題自動生成スクリプト
========================
使い方:$0  種類 個数

種類
------------------------------
問題の種類の番号と内容の対応は以下の様になっています。
1:正負の数の四則演算
2:文字と式の計算問題
3:1次方程式の計算問題
4:二元連立1次方程式の計算問題
EOS
    exit;
fi

case  $1 in
    1)
	./calcgen1.sh $2;;
    2)
	./calcgen2.sh $2;;
    3)
	./calcgen3.sh $2;;
    4)
	./calcgen4.sh $2;;
esac
